КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Справочники.КонтурЛогистика_Настройки.Выбрать().Следующий() Тогда 
		Справочники.КонтурЛогистика_Настройки.ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПредопределенногоДляРасширения = Элемент.ТекущиеДанные.ИмяПредопределенногоДляРасширения;
	
	Если ИмяПредопределенногоДляРасширения = "АдресСервераSMTP"
		Или ИмяПредопределенногоДляРасширения = "АдресЭлектроннойПочты"
		Или ИмяПредопределенногоДляРасширения = "ПользовательSMTP"
		Или ИмяПредопределенногоДляРасширения = "ПортSMTP"
		Или ИмяПредопределенногоДляРасширения = "ИспользоватьСистемнуюУчетнуюЗапись" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ИмяПредопределенногоДляРасширения = "ОтображатьПанельВУчетныхДокументах" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"ОбщаяФорма.КонтурЛогистика_НастройкаОбщепродуктовогоРасширения",, ЭтаФорма, ЭтаФорма,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Сегодня" , "С сегодня");
	Кнопки.Добавить("Выбрать" , "Выбрать дату");
		
	Если ИмяСобытия = "КонтурЛогистика_УстановитьДатуГраницыПолученияПечатныхФормЭПД" Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Настройка", "ДатаГраницыПолученияПечатныхФормЭПД"); 
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУстановитьДатуГраницы", ЭтаФорма, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, "С какой даты сохранять печатную форму ЭПД в присоединенные файлы?", Кнопки);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_УстановитьДатуГраницыСохраненияАрхиваДокументооборота" Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Настройка", "ДатаГраницыСохраненияАрхиваДокументооборота");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУстановитьДатуГраницы", ЭтаФорма, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, "С какой даты сохранять архив документов?", Кнопки);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_УстановитьКаталогСохраненияАрхиваДокументооборота" Тогда
		
		ПроверитьЗаполнениеКаталогаАрхива();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПоискОснованийКодНа1СПоУмолчанию" Тогда
		
		ПодключитьОбработчикОжидания("НачатьЗаполнениеПоискаОснованийКодНа1СПоУмолчанию", 0.5, Истина); 
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеПоискаОснованийКодНа1СПоУмолчанию()
	
	Результат = ЗаполнитьПоискОснованийКодНа1СПоУмолчанию();
			
	Если Не Результат.Успешно Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(Результат.ОписаниеОшибки);				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаУстановитьДатуГраницы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "Сегодня" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьНастройку(ДополнительныеПараметры.Настройка, НачалоДня(ТекущаяДата()));
		
		Если ДополнительныеПараметры.Настройка = "ДатаГраницыСохраненияАрхиваДокументооборота" Тогда
			ПроверитьЗаполнениеКаталогаАрхива();
		КонецЕсли;
		
		Элементы.Список.Обновить();
		
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДатыГраницы", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВводДаты(Оповещение, ТекущаяДата(), , ЧастиДаты.Дата);

	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеКаталогаАрхива()
	
	КаталогСохраненияАрхиваДокументооборота = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("КаталогСохраненияАрхиваДокументооборота");
			
	Если Не ЗначениеЗаполнено(КаталогСохраненияАрхиваДокументооборота) Тогда		
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУстановитьКаталогАрхива", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Необходимо установить каталог сохранения архива документов", РежимДиалогаВопрос.ОК);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДатыГраницы(ВыбраннаяДата, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УстановитьНастройку(ДополнительныеПараметры.Настройка, ?(ВыбраннаяДата = Неопределено, НачалоДня(ТекущаяДата()), ВыбраннаяДата));
	Элементы.Список.Обновить();
	
	Если ДополнительныеПараметры.Настройка = "ДатаГраницыСохраненияАрхиваДокументооборота" Тогда
		ПроверитьЗаполнениеКаталогаАрхива();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаУстановитьКаталогАрхива(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		ПоказатьЗначение(, ПолучитьНастройкуПоИдентификатору("КаталогСохраненияАрхиваДокументооборота"));
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкуПоИдентификатору(ИдентификаторНастройки)
	Возврат Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", ИдентификаторНастройки);
КонецФункции	

&НаКлиенте
Процедура ДобавитьНовыеИОбновитьОписание(Команда)
	
	Результат = ДобавитьНовыеИОбновитьОписаниеНаСервере();
	Если Не Результат.Успешно Тогда
		Сообщить("Возникла ошибка:" + Результат.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	Сообщить("Добавление новых и обновление описание завершено");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьНовыеИОбновитьОписаниеНаСервере()
	
	ТолькоНеинициализированные = Истина;
	ОбновлятьОписание = Истина;
	
	Возврат Справочники.КонтурЛогистика_Настройки.ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(, ТолькоНеинициализированные,, ОбновлятьОписание);
	
КонецФункции

&НаСервере
Функция ЗаполнитьПоискОснованийКодНа1СПоУмолчанию()
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Истина);
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
	
	Если Не КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации Тогда
		Возврат Результат;
	КонецЕсли;
	
	НастройкаКонвертации = КонтекстНастройкиКонвертации.НастройкаКонвертации;
	
	Если ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С)
		И Не ЗначениеЗаполнено(НастройкаКонвертации.ПоискОснованийКодНа1С) Тогда
		
		НастройкаКонвертацииОб = НастройкаКонвертации.ПолучитьОбъект();
		
		Попытка
			
			НастройкаКонвертацииОб.Заблокировать();
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки = "Алгоритм вычисления дополнительных документов основания не будет записан в настройку конвертации Т1 ЭТРН. "
				+ Символы.ПС
				+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
						
			Результат.Вставить("Успешно", Ложь);
			Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			
			Возврат Результат;
			
		КонецПопытки;
		
		
		НастройкаКонвертацииОб.ПоискОснованийКодНа1С =
			Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПоискОснованийКодНа1СПоУсолчанию(НастройкаКонвертации.ТипДокумента1С);
		НастройкаКонвертацииОб.Записать();
		
		РазблокироватьДанныеДляРедактирования(НастройкаКонвертации);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
